load/artillery.yaml
config:
  target: "http://localhost:3000/api"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 100
      name: Ramp up load
    - duration: 180
      arrivalRate: 100
      name: Sustained load
  payload:
    path: "ManyUsersOneItem.csv"
    fields:
      - "userId"
      - "itemId"
      - "quantity"

scenarios:
  - name: "Buy products"
    flow:
      - post:
          url: "/noAuthPurchase"
          json:
            userId: "{{ userId }}"
            itemId: "{{ itemId }}"
            quantity: "{{ quantity }}"